app/views/users/show.html.erb


<% @user.posts.each do |post| %> </p>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 24]]