app/views/posts/show.html.erb


<% @post.comments.each do |c| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 39]]